class SentenceRepository {

  static List<String> getSentences({
    required int grade,
    required int level,
    required String risk,
    required int activity,
  }) {

    final key = "${grade}_${level}_${risk}_A$activity";

    final Map<String, List<String>> sentenceBank = {

      // =========================
      // Grade 3 - Level 1 - LOW
      // =========================
      "3_1_LOW_A1": [
        "කොටියා වනාන්තරයට ගියා.",
        "අම්මා කිරි උණු කරයි.",
        "මල් වත්ත ලස්සනයි.",
        "කුකුළා උදේ හඩයි.",
        "මිතුරෝ පාසල් යයි."
      ],

      "3_1_LOW_A2": [
        "අපි බෝලයෙන් ක්‍රීඩා කරමු.",
        "දරුවා පොත කියවයි.",
        "හිරු ආලෝකය දෙනවා.",
        "ගුරුතුමා පාඩම කියයි.",
        "මගේ මිතුරා සිනාසෙයි."
      ],

      // =========================
      // Grade 3 - Level 1 - MEDIUM
      // =========================
      "3_1_MEDIUM_A1": [
        "දරුවා පාසලට ගොස් පොත කියවයි.",
        "අම්මා අලුත් ආහාරයක් පිසුවා.",
        "හිරු එළිය ගෙට වැටෙයි.",
        "මල් වත්තේ සුගන්ධය පිරී ඇත.",
        "කුකුළා උදේ පාන්දර හඩයි."
      ],

      // =========================
      // Grade 3 - Level 2 - HIGH
      // =========================
      "3_2_HIGH_A1": [
        "දරුවා සෙමින් වචන කියවයි.",
        "අම්මා උදව් කරයි.",
        "පොත අල්ලා ගන්න.",
        "වචන පැහැදිලිව කියන්න.",
        "ඉක්මන් නොවන්න."
      ],
    };

    return sentenceBank[key] ?? [
      "No sentences available."
    ];
  }
}